{
    "id": "20250205194607_187",
    "name": "Kashi Dairy veg restaurant",
    "star": "3.8",
    "number": "926",
    "score": "3518.8",
    "area": "Vasco da Gama",
    "url": "https://www.google.com/maps/search/Kashi+Dairy+veg+restaurant+Vasco+da+Gama",
    "restaurant_image": "https://lh3.googleusercontent.com/p/AF1QipM9W9w8Z8lAUq9JzYzWDHu2sPOIeuGe9siWQXJV=w408-h240-k-no-pi0-ya320-ro0-fo100",
    "tags": [
        {
            "tag": "aloo paratha",
            "count": "21"
        },
        {
            "tag": "lassi",
            "count": "21"
        },
        {
            "tag": "samosa",
            "count": "18"
        },
        {
            "tag": "hotel",
            "count": "14"
        }
    ],
    "reviews": [
        {
            "review_text": "Location is good - at a walkable distance both from Vasco Bus Stand and Vasco Railway Station.\nThe food is strictly veg and tastes excellent. Comparing the quantity and quality with other available options nearby, this restaurant is far better than anyone.\nBehaviour of the staffs are excellent and response is also professional. The pricing of food is also very much affordable.\nThe only factor I've observed is it's seating capacity is not sufficient according to demand and number of customers incoming. Thus, always a waiting crowd may be seen during the peak hours.\nApart from this, like more other restaurants nearby, this place doesn't have any designated parking place available. The vehicles are to be parked on street on owner's own risk.\nBut, if you crave for some veg delicacies under pocket friendly budget, I would definitely recommend this place to visit once.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnGsWPsIhXqDjbzE5m-EUK-RPOg8K5rM8aFde2N0au2msQSo7wWhpiEaCth9c_waCGLp0Cqw5-vz5xRvXtpL61aNZ7QKXCLzC8eDthyPSWWLQ2mdRwjG6MhAO3cVXbW5hbutR3E=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmjYtu5Z7XZqfI86hO7aKm8jXs911iBua3HPPhfcRirI_wFYi65gZEeclepO7cn_-pVHhMzW2v6FnoERWMFYhydyy4ZmaDJXlqaPV2Y06XRj6dquuGT1Xo6dsqV7pQb0KN_Ne2WpA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlGcA0b-x0Wl4XiYjkHhBMTcv1InBf0dQR0sbEuYSgWRjL2KqZx7hHWfOjIzOET9lz-fn0UElR2GKgGl2OWdIsnMyjcpQ3aprCeAHs8_fECzppfhJCyJL3ANNCa3jaueBrzxuf0=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdn7MdNE2VN2ZeJvenNrelv1XXMqvqb-CdfB39KDGCDRqyuA6lSlkcI3rZSscfeY0UvSqc9bapI2uXVbIDuiU-OCrp8YSKjWOD76xnbAczgMxAFvoKMznDE3HX6we96Bj2085pixMA=w375-h281-p"
            ]
        },
        {
            "review_text": "So a friend of mine randomly remembered this place where he had eaten this AMAZING paratha in 2008. Didn't remember anything but the taste of the paratha from back then. We googled the best paratha in Vasco, and this was one of the first places. We saw the photos and narrowed them down because this looked the best.\n\nWhen my friend had the first bite, he knew this was the place we were looking for! Such is the taste of this place that everyone remembered it after 15-odd years!\n\nThe place is generally open very late, till 11 o'clock. There are two sittings, one non-ac on the ground floor and AC on the first floor.\nThey have takeaways as well, which probably comprise most of their orders. This can mean the service is slow, but that's not the case here. The staff is active, and the small kitchen on the first floor makes getting smaller things out quickly possible. But but, we've seen the waiter get lost and forget which table ordered the fried rice. So that was a meh.\n\nWe ordered the classic Aloo Paratha, which they serve hot with curd. We also ordered Matar Paneer because it was too late to eat curd. The paratha was stuffed and was more than enough for one person's meal. The matar paneer tasted really good as well.\nNot sure if the AC/non-AC sitting has different prices, but the price was really affordable for the taste and the service in the AC section as well.\n\nOverall, it was a great experience, mainly because of the story my friend had with the place. But kudos to the restaurant for not disappointing!\nWould definitely recommend it for lunch/dinner if you like parathas.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlSLbpK0X6WmL0M6b2LiREVaiSd1Rg9NjQp-BZNcVV3gcej-x4w7UIRRSyjKTu_7XZYJYPgt8JDoCHB0P8H1ovmgG9KcIZ_bCvdAbCMxiP0r2zS_iMbMA6e9MyM8DUN14zXCNY=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnDKoZ9g56dIPE7bFXr1h83BtsgE596uJizud3VBkeLT_ak9FHTEl90dbsm1Bxod-R_hr9wqWSXxwI0jL-nTKoYSnbBaym1tiZ6zK3adzOGevee-U33VilJj8wFJ9MW-ibAV18QSw=w375-h563-p"
            ]
        },
        {
            "review_text": "Good food, chole bhature, samosa is the best small in size though as compare to price,\nChole bhature is an excellent choice and so does the pav bhaji\nI will never prefer to order aloo Paratha here. Was not as per my expectations.\nLassi is must try..\nMassala Dosa is ok, but not as per mark..",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdl8FY5FzTyvslAAWD9sBOKjOuzPFVhzm9hbiVDjje3XO_m1cdMM9P2_hrj0F1aOKHGQxMPCM4tqSnEd0NUFxqC2Uoaq4151CkBig3Xv90ZhXAurPMcYZuzy2v7onHIQV8VIkyXi=w750-h563-p"
            ]
        }
    ]
}