{
    "id": "20250205191742_126",
    "name": "Shri Krishna Pure Veg Restaurant",
    "star": "3.9",
    "number": "1400",
    "score": "5460",
    "area": "Airport, Dabolim",
    "url": "https://www.google.com/maps/search/Shri+Krishna+Pure+Veg+Restaurant+Airport%2C+Dabolim",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipN0BTj6kOvldyQ-L1RJscg4OVEZABSwxQHNG7E0=w408-h306-k-no",
    "tags": [
        {
            "tag": "price",
            "count": "26"
        },
        {
            "tag": "breakfast",
            "count": "22"
        },
        {
            "tag": "airport",
            "count": "18"
        },
        {
            "tag": "value",
            "count": "7"
        }
    ],
    "reviews": [
        {
            "review_text": "I recently visited Krishna Pure Veg Restaurant in Goa and found it to be an overall average dining experience. The ambiance is simple and clean, though nothing particularly stands out. The menu offers a good variety of vegetarian dishes, and the prices are quite reasonable.\n\nThe food quality was decent; some dishes were flavorful, while others were a bit bland. The service was prompt, but the staff could have been more attentive and welcoming.\n\nIt's a decent spot for a quick vegetarian meal, but it didn't leave a lasting impression. If you're looking for a straightforward dining experience without any frills, Krishna Pure Veg Restaurant might be a suitable choice.",
            "photos": []
        },
        {
            "review_text": "Located conveniently next to Bangalore Bakery at Dabolim Junction, Shri Krishna is a budget-friendly restaurant known for its diverse menu featuring South Indian, North Indian, and Indo-Chinese cuisine. While the seating setup may be basic, the real highlight here is the delicious food they offer. The service is satisfactory, and although it may not be exceptional, there are no significant complaints. It is worth noting that Shri Krishna is a popular choice among workers and laborers for breakfast, so if you find yourself in a crowded dine-in situation, it would be wise to opt for online ordering or takeaway for a quick and convenient dining experience.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmiKmivKodNmBimhfhIzfb2jrmpS3zTqGwzIb7N9mQTDarFroTDvmilTyH0EGrF3KRjoD4c8AM8nFAcZO3ixfSwwLkEDuNeDfi-i_a8ss31GKVYta3zUxo26Dqhmjsyi7o2lxn0Gw=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkaolMf9EulMekFZKADtAmWx0yJAbU16Oja9j0BZIKztNhnewOW4p6cGfHklITEfcrsGqkh3zJ6LOlbB6od8B9KGpE0gTo5h8-VMyHoTU-PVfETiWLmxwisrgLp1VJxdNlpmHfg=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnOXWg_x-0125GpzoEUnIft1IkWxTLlXq8TJ6wBZZV_B7kY8tr-daNd1ZqAsRJ_fhFwSBgq9tggywql3aiF3K7m-7agnjuuyEZubH7vlE8QlqHYbuoPDkBBh8UelaNqrN10NoYmiw=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmmjSZaxv7P-zMYxf5vp6wuBaFeUt5GbSYd-61_aDLWkZajG876lMOAXd8M6WIo8O0iva-ORHmLkj6oDdoqxBQ6C_eMQaMXTVxJcfQDsEDD0vXWW-W4swAHjw8-DdQMmip-tolC=w375-h281-p"
            ]
        },
        {
            "review_text": "Worst place to order food from.. Ordered from zomato.. Masala dosa, Vada Pav and Onion Uthappam.. Batter was not cooked properly.. potato stuffing in masala dosa and vada felt too stale.. and nothing felt edible . Had to throw out everything to avoid making our stomach upset ..\nDon't try it ever..",
            "photos": []
        }
    ]
}