{
    "id": "29c14da59262a271535b23d9cba2c2ec",
    "name": "UPTOWN- Multi Cuisine Restaurant - Pub - Sports Bar",
    "star": "4.7",
    "number": "1213",
    "score": "5701.1",
    "area": "Bambolim Camp",
    "url": "https://www.google.com/maps/place/UPTOWN-+Multi+Cuisine+Restaurant+-+Pub+-+Sports+Bar/@15.5183442,73.7677268,17z/data=!3m1!4b1!4m6!3m5!1s0x3bbfc1be337b9f9b:0xeb22b3d94c6dc63a!8m2!3d15.5183442!4d73.7677268!16s%2Fg%2F11qyg231wz?authuser=0&hl=en&entry=ttu&g_ep=EgoyMDI1MDIwMy4wIKXMDSoASAFQAw%3D%3D",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipNTF8OaNuWHFPYDRjJe7qOGBU8d9-jjbNRy629x=w408-h272-k-no",
    "tags": [
        {
            "tag": "singer",
            "count": "37"
        },
        {
            "tag": "evening",
            "count": "34"
        },
        {
            "tag": "cocktails",
            "count": "19"
        },
        {
            "tag": "hookah",
            "count": "19"
        }
    ],
    "reviews": [
        {
            "review_text": "Uptown Restaurant in Goa is a delightful dining spot that excels in many areas, making it a popular choice among locals and visitors alike. The highlight here is undoubtedly the food. The restaurant serves a delicious array of dishes, with flavors that are rich and satisfying. Whether you're indulging in their expertly prepared seafood, savoring a well-cooked steak, or enjoying one of their many vegetarian options, the culinary experience at Uptown is impressive and leaves you craving more.\n\nThe service is also commendable. The staff are attentive, friendly, and always ready to assist, making sure that your dining experience is as smooth and enjoyable as possible. Their professionalism adds a nice touch to the overall ambiance, which is stylish and vibrant, perfect for a relaxed evening out.\n\nUptown offers the convenience of valet parking, which is a welcome perk considering the bustling location and the crowd it attracts. This makes the dining experience hassle-free, allowing you to focus on enjoying the evening without the worry of finding a parking spot.\n\nHowever, the restaurant’s popularity does come with a downside: space can feel a bit cramped, especially during peak hours. While the ambiance is inviting, the limited seating area can sometimes feel overcrowded, which might take away from the otherwise pleasant atmosphere. Additionally, if you're planning to dance the night away, it's important to note that the dance floor closes at 10 pm, which can be a letdown for those hoping for a late-night party scene.\n\nOverall, Uptown Restaurant is a great choice for those seeking delicious food and good service in Goa. Despite the slightly limited space and early closure of the dance floor, the flavorful dishes and attentive service make it a worthwhile visit. It's a vibrant spot for a memorable meal, just be prepared for a lively crowd if you visit during busy hours.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdn_DyB0gG61ePlZ169mTcIyNEfW8mYw3ZFsXl-yOQ9JeI3YrhIbSvuP30AFtGnyg6OhEoPHuMpC5kKB-eK6uoxYG4esxxM5rb59xXaeDXzHaqgKIQNK0olVWTFv_y2pB4BF-nUs=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlpYVMbS0BSBaQHQRvAVmuzpRpujSRXQCGQLfrPNtNgRVkAa3zurx5zi2aKOZg5-E3zE3d277Ui3dmrDKH81LcyQIHQWeZVWiBCJbYhkWPSowJ10eX6Zuc9pFbB0lH7TLlr341J0w=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmhSdn0X6wLAUkb7mdlL2_Qym4gd0qNWjQqn7Dd27nUBSHGzcaR2FlMBzWziK1vAsVuj-RZ_6mYjOKzd54-t6gw5kEUc-19WQouA0vp0xeX-81WKTadpbKFV9oDvrvruN3z0fr1=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdn2Ci0bUbOUhc3zQwI9Eo2jjg2PbsD3dZFHTUqIfrvoujRjOFlOvCjDQY0SD6R4Y-u1FT63J6yq5bBaYaHuikSPpLfMz43ZjjzmGw-esA52H4KAFf8rxZHnPzBSlfeh4aVMuLNFWg=w375-h281-p"
            ]
        },
        {
            "review_text": "I had a good service and the chicken tikka was delicious. I had one beer and a few shots of the cashew spirit with soda. Then I ordered  fish curry, but in the end they made me pay for a curry that costed me 2500 rupees in the end of the menu (instead of 500). In total, I ended up with a bill of 4200 rupees. I tried talking to the manager, but nothing happened. I’m definitely not going back and you should make sure you’re paying for what you asked.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlySkeqSEwVjSPUr3blW293ulJM6B9Zhw3sR09DIfMVS31oAQ_JIP2PqwlQpn6uJgnpIN6n4Ev0r-sdxW7Thj4lpBl7CafhfK4NqWSLZImthXtDNBQWHTlSCSM8TVdlfzThSJdP=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlR_yr6pbMuVORltWVR3YPEl0mR0XOjtdEYqu6BvV2UCBoxcXIHfDWLnuXaAg6SS7P8_EA1bcIAQZVGrPvH1agrQWVbvkWl_EDjbXMyH_73XGqgSgllPvtIw26MCCdCjGrXgbhOaw=w375-h563-p"
            ]
        },
        {
            "review_text": "We recently dined at this gem of a restaurant in Candolim, and the experience was fantastic! The food was absolutely delicious—everything we ordered, from the fish fingers to the noodles and naans, was lovely and served in generous portions. While good food is something you can find in many places, what really stood out here was the service. Our waiter, Saddam, ( a big shout out to him) he was exceptional—super friendly, attentive to all our needs, and even made sure my 1.6-year-old was comfortable, which really added to the whole experience.\n\nIn an area like Candolim, known for its many great spots, we’re thrilled to have found this one. Though I live in the south of Goa, which is quite a drive, I’ll definitely be returning here again. Highly recommend!",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdllgVnXf4ZCzDCiIksrK3A9OCk21xVsdH6qSn8cs4OJRwA7r-FBzTte8lBBlXb_PV-LKuX8_JtzJN7P_UGoNgQLkv_Yz-boWwnzbcOBPUUP9pa42BTRRO5DFkT0P5XasZPYvsLF=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnp-zRCrH4N6VYZGRyus68r11sgox5hdcoRr-k5Ec2hY1mXpHrJ0xMDN0O7zgrMBZL5yk_xjrgeIH2ZAiEjAq29csEt1u7bQEYw4ci6RToRHfAFIVEuGOWefB9VVPx0RiLN5YWIlA=w375-h563-p"
            ]
        }
    ]
}