{
    "id": "20250205230312_120",
    "name": "Oasis cafe Anjuna",
    "star": "4.2",
    "number": "1103",
    "score": "4632.6",
    "area": "Anjuna",
    "url": "https://www.google.com/maps/place/Oasis+cafe+Anjuna/@15.5852634,73.7404023,17z/data=!3m1!4b1!4m6!3m5!1s0x3bbfe983b8f41d5b:0xcafb7c094a199743!8m2!3d15.5852634!4d73.7404023!16s%2Fg%2F124yn25n4?authuser=0&hl=en&entry=ttu&g_ep=EgoyMDI1MDIwMy4wIKXMDSoASAFQAw%3D%3D",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipMaO2rAGaeIkivGG3lgmWwjLQYx-WT4UYOhVdCg=w408-h544-k-no",
    "tags": [
        {
            "tag": "service",
            "count": "42"
        },
        {
            "tag": "music",
            "count": "24"
        },
        {
            "tag": "seafood",
            "count": "14"
        },
        {
            "tag": "naan",
            "count": "14"
        }
    ],
    "reviews": [
        {
            "review_text": "Id been recommended this place by a friend, so we came here in the afternoon for lunch. I ordered the crab xacuti and my friend ordered the fish curry, both of us with jeera rice. The food was decent, I can't complain too much about the taste of the curries. The jeera rice was also decent, but it's really nothing impressive. I had a difficult time extracting the meat from the crab, and most of it was holding on to the shell for dear life. I also found small bits of the crabs shell in the curry sauce, which occasionally gave an unpleasant and misplaced crunch. The atmosphere of the restaurant is great. It's quite fun to sit inside and read some of the funny signs. We also ordered some drinks like coffee and juice, and we noticed that the cups were terribly dirty--not a great sign. The coffee was also horrible, as I assume it was nespresso, however, I understand that this is not their speciality. There are definitely other places that have much better curry, but this place does have a pretty big menu, offering many different dishes.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdluE0ukNUv2zKLg7294fprJc0q0DDqZS6xF13W82mhWRL2YQBmHMhGQPAKvdHpv2Ez2Ge3iUolpJWxG_emdq7qkMmoDQuJFZxfVHa__X0TRucMRqCCK7fUz6PuhaV8o73ePkQ=w750-h563-p"
            ]
        },
        {
            "review_text": "We were recommended this place by a friend. Maybe he fell on his head as a child because his decision making skills are severely lacking. We ordered some soft drinks, coffee and curries. The coffee was possibly scooped out of old 70s fishbowl, acquiring a bad taste. However, the watermelon was hand picked from the vines beside and juices sensually from the hands of the server into my parched mouth. The juice was divine. The curries were exceptionally good, although not the best I've tasted (see my review of Krishna restaurant). If you stumble upon this place, you'll have a good curry. Bye",
            "photos": []
        },
        {
            "review_text": "On a recent goa trip we visited this restaurant\nThe chef knows his job really well whatever we ordered the taste was up to the mark prices are little bit competitive but yes compared to other restaurants in the locality this one is still better, if someone is looking for lip smacking food this is the restaurant you should look for.\n\nMust try - crispy chicken 😋",
            "photos": []
        }
    ]
}