{
    "id": "20250205232818_176",
    "name": "UDUPI PALACE",
    "star": "3.3",
    "number": "826",
    "score": "2725.8",
    "area": "Complex Altinho",
    "url": "https://www.google.com/maps/place/UDUPI+PALACE/@15.4967876,73.835924,17z/data=!3m1!4b1!4m6!3m5!1s0x3bbfc084806e22e9:0x5be176ec84e95739!8m2!3d15.4967876!4d73.835924!16s%2Fg%2F11b6qkjpht?authuser=0&hl=en&entry=ttu&g_ep=EgoyMDI1MDIwMy4wIKXMDSoASAFQAw%3D%3D",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipNv4UT3ngPP1_U07Ot9JBY5GuarUBn_acIkgWcn=w408-h725-k-no",
    "tags": [
        {
            "tag": "price",
            "count": "28"
        },
        {
            "tag": "bus",
            "count": "24"
        },
        {
            "tag": "breakfast",
            "count": "13"
        },
        {
            "tag": "name",
            "count": "11"
        }
    ],
    "reviews": [
        {
            "review_text": "I visited this place since it’s conveniently located near Panjim Bus Stand, making it an easy stop during my travels. After scanning the menu, I decided to try their veg thali.\n\nUnfortunately, the experience didn’t quite live up to my expectations. The taste of the food was rather average—not bad, but certainly not anything to rave about. It lacked the rich flavors and freshness that I was hoping for.\n\nWhat stood out more was the hygiene, or rather, the lack of it. The cleanliness of the place left much to be desired, which made the overall experience a bit uncomfortable. It’s definitely something the management should work on to make customers feel more at ease.\n\nWhile the location is great for a quick bite, I would suggest looking elsewhere if you’re seeking a more satisfying meal or a cleaner dining environment.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkpxYABfOIomXt83TjlO5IatckiCRB3YaxES-DlSqxxAOakye8bzjSTf6QJelyvB6cIvIRB6zOVDk22zANrWww7wqSbrlPuqbs5mcrVk4pj3kmCcMLb6KQpaqc3lG9VFN0QUgv_Xw=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmDPCMlR1ccDrWCvWljDKt1xFW7GZntPZyd6pLt8eSUl2LJtliZaTc64-M3T4P1sDTcMnPzKnuWEXma3ZnIobOyfpSMtFNoFOuE73qrFSbFtniy-j62fcS7KmGyFTGEQdrwkyBZ=w375-h563-p"
            ]
        },
        {
            "review_text": "- Tea and coffee were served in use-and-throw cups, reflecting poor standards for a restaurant setup. Even small roadside tea stalls (tapris) maintain better quality in serving.\n\n- The masala dosa was served cold, including the potato bhaji filling inside. Despite mentioning this to the owner, he insisted it was freshly prepared, refusing to acknowledge the issue.\n\n- The owner showed a dismissive attitude when provided feedback about the cold food, unwilling to even verify the complaint.\n\n- The menu card was dirty, adding to the overall impression of a poorly maintained establishment.\n\n- It seems the restaurant relies on its location near the bus stand, assuming customer reviews and feedback won’t matter due to transient footfall.\n\nI do not recommend this place. The poor food quality, lack of cleanliness, and dismissive attitude of the management make it an unworthy choice, even for a quick meal.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdm0eqBm7EHdpa1Aa9mqvVh_YN5LeBYqvuE3JaOtZCudUWucsBuqcRA6c_2lZWeW_yvGUygy42IK3W3O4VJ4il4Ail-L1TJex4MFaSwf_ACsfey2R5bu2YUe3LsCdOmAs2L-fFQZ4w=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdn0YXsmxXsm3og37s7sfbp4nFV33JJnF2Ef0q66VnVK0ZmlagaCT5ug3g9bUdXOYSs-YDMpugmORMiB3_LcxcadQ_17lGTb0sje_8UHJKj5Yz2nhfFsV1WUoLaj6X1KJ0jMcbIY=w375-h563-p"
            ]
        },
        {
            "review_text": "During my recent trip to Goa this was the first place where I had breakfast. The experience was so pathetic 😥!!\n\nI tried the bhaji pav. The food was okayish!!\n\nBut what made me question my choice was the way the waiters behaved. They behaved as if they had no interest to take order 🤨!!\n\nI wanted to order something else after the bhaji pav but they kept delaying to come to my table even after constant requests (the place wasn’t busy either) 😒!!\n\nSo we decided to pay the bill and leave. We then later ended up having more food at a nearby restaurant. In a place like Goa which is famous for pub hopping, we were food hopping 🍺🙃!!\n\nI can tolerate the idea of food being not good or up to the mark. But poor customer service is something all restaurants should avoid 😬!!\n\nIt’s not like we’re compromising good food and good customer service for fair price. I’ve been to cheaper restaurants where the food and the service were both good 🙄!!\n\nWe travellers don’t deserve to be treated like this especially after a long and tiring journey 😥😩!",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlk2oTFNhGJ8OTp-Ij6K2DJOVWY-XcMGpGR2DuGI0wIJrjvX7oW6sxaENlkXIS5QrT6MoJI6J6vsKqcy2QJZLQO6CukrBcFzgw-7k1AxDQOAhcc1cI8RFoXemFaNCNYuUVFVmL0PA=w750-h563-p"
            ]
        }
    ]
}