{
    "id": "20250206004214_362",
    "name": "Senses Goa",
    "star": "4.8",
    "number": "134",
    "score": "643.2",
    "area": "Anjuna",
    "url": "https://www.google.com/maps/place/Senses+Goa/data=!4m7!3m6!1s0x3bbfe96318f9e0d9:0xc51f42d6c0cc63d4!8m2!3d15.5946715!4d73.7375994!16s%2Fg%2F11rd8tzwcc!19sChIJ2eD5GGPpvzsR1GPMwNZCH8U?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipMJSihtj1qT64uGIxa58YxXt6exM0ngU30rFNV-=w426-h240-k-no",
    "tags": [
        {
            "tag": "cocktails",
            "count": "13"
        },
        {
            "tag": "cats",
            "count": "5"
        },
        {
            "tag": "hospitality",
            "count": "5"
        },
        {
            "tag": "signature",
            "count": "4"
        }
    ],
    "reviews": [
        {
            "review_text": "Best food we’ve had in India!  They make the food from scratch for every dish including the pita bread and you can tell, the flavours are just so fresh. It was so wonderful!\n\nThe owner Kimberley is an absolute gem! She came and chatted with us after we had our meal and she’s just so personable and lovely that it made our experience so much better. Thank you so much for a fantastic experience 🙏💕",
            "photos": []
        },
        {
            "review_text": "Senses is an absolute gem! From the moment you arrive, you're surrounded by the most beautiful natural setting.\n\nThe food is phenomenal! Everything is crafted in-house, from the freshly baked bread to the syrups that elevate their cocktails. You can tell the difference—every dish and drink feels thoughtfully prepared with the finest ingredients. Their cocktails, in particular, are a must-try!\n\nThe service was just as impressive. Kimberley and Pravin are super friendly, knowledgeable, and really go out of their way to make sure you’re having a great time.\n\nIf you’re visiting Goa, Senses should definitely be on your list. It’s the kind of place that leaves you wanting to come back again and again!",
            "photos": []
        },
        {
            "review_text": "Wow what amazing food! Honestly, we were in food heaven. The service was impeccable too. Vibe was on point. An absolute gem of a place. Will definitely be back, a few times! ❤️❤️❤️❤️❤️",
            "photos": []
        }
    ]
}