{
    "id": "20250206001649_296",
    "name": "Thaal - Bonding Over Food",
    "star": "4.2",
    "number": "234",
    "score": "982.8",
    "area": "Reis Magos",
    "url": "https://www.google.com/maps/place/Thaal+-+Bonding+Over+Food/@15.4970957,73.7997217,17z/data=!3m1!4b1!4m6!3m5!1s0x3bbfc165bbe71dff:0xb89ef073114eaa1e!8m2!3d15.4970957!4d73.7997217!16s%2Fg%2F11ghlfqy6j?authuser=0&hl=en&entry=ttu&g_ep=EgoyMDI1MDIwNC4wIKXMDSoASAFQAw%3D%3D",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipMAyTBHDf9vosEql9owo6qu4Qny8fPAsI8OnSd4=w433-h240-k-no",
    "tags": [
        {
            "tag": "cuisine",
            "count": "20"
        },
        {
            "tag": "bohra",
            "count": "10"
        },
        {
            "tag": "thaali",
            "count": "10"
        },
        {
            "tag": "cutlets",
            "count": "9"
        }
    ],
    "reviews": [
        {
            "review_text": "The word Thaal is iconic with the Bohra Cuisine and hence full points to Rumama Roowala for naming her restaurant ‘Thaal’.\n\nLocation and Ambiance\nThaal which is located right opposite the Coco Beach on the Reis Magos Fort Road has both indoor and outdoor seating options. The indoor option with its low floor seating is where the traditional thaal is served. For savoring a thaal, you need to be in a group of minimum 3-4 people, otherwise, you could sit in the outside area and enjoy the smaller versions of thaal called thalis.\n\nWe chose a lazy Friday afternoon for our lunch at Thaal. Since we were just two people, me and my son, we opted for thaalis and sat down in the outer seating area that oversees the coco beach. It was a bright, beautiful and breezy afternoon, perfect to enjoy a great meal. The view was great too.\n\nFood\nComing to food, we ordered two thalis for ourselves, one can choose between the starters, but the main course changes on a daily basis. But we were lucky and got to savor two different main course dishes as well. As per Bohra tradition, the meal usually begins by tasting salt which acts as a palette cleanser, it is then followed by a dessert, they consider it auspicious. So keeping with the tradition, I started by eating my dessert first, the Kalamra, which is basically sweetened curd and rice with lots of dry fruits in it. It was quite nice, after this I came to the Channa Batata, a salad with chickpeas and potatoes tossed in nice tangy tamarind chutney and the best part was some fried onions on the top, they enhanced the overall taste so much.\n\nMy starter included the Bohra Chicken Cutlets, these were simply amazing, crispy coating on the outside and almost melt in the mouth soft on the inside. Subtle flavors and a perfect texture, these definitely are worth trying.\n\nMy son’s thaali had Keema Pao as a starter and that too was excellently prepared. The Keema was delicious and the Paos soft and buttery, it made for a perfect combination.\n\nFor the main course, while I got to try Daal Gosht with Rice, my son had Gosht Biryani and both these dishes were mind-blowing. Especially the Daal Gosht is one dish that you definitely should not miss. The mutton pieces in both the dishes were extremely juicy and tender and that speaks for the quality of food. The biryani was Kacche Gosht Ki Biryani, which means that everything is cooked together and that’s one of the prime reason for getting out the best flavors. All meat is marinated overnight and slow cooked for about 4-5 hours and this explains its tenderness perfectly.\n\nTo finish my meal, Sheer Khurma, the dessert made with sweetened milk, dates, vermicelli, and loads of dry fruits was just perfect.\n\nSo I highly recommend it to both my Goan readers and friends and my readers from across the country and globe that when in Goa, this place should definitely be on your list.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnSrFcMSU9EakXawgPPWGw7zHhWXNQj8fHXMy4RfHxzizhtBzVDAWbWVGiyewcVIJ2TfUJe3Rf5TJwW3h67zOzJBgPRHa6GwOnNQWf-K3whwZq8mwiGaB59UjjIVEsKgnj2WZHznA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkUtnADXRiqGeyzaY6Tnjus0lxzpsiDN_k-md-DIBTd07gU_ZaEFSZC_U1PpAu493skVsD5SfW7mzgUYrTWoAXSl7Dt1flXQ0LK6G3q38VXaVFNFvvB2aOhaYXsoKoc9dZyBv7a=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdltkXzC8DW1Gikv6tHMvpRLXHmUFtMFXJSzlqm0WaAVlbov_nSEuxGj6Td_y6v1xyhns-nD4okr7DBnLtLj_KJySziY_DAAWPCPFTMqHB3tXKuLXSwpaI4F3QVVEDnqZrv6ul4q=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlRF_Pe3GwYCBRrDScNy20LlrETCo2yZjvXRHjzs8-0aC1BaY-_x0VdTHf-6v59aggisGX6trSo-smVcV4Xwi4eHdfMs-t9PWnOsIG9268YIv0VJCzRUijhhDL-UGo4Y21rOuQ8=w375-h281-p"
            ]
        },
        {
            "review_text": "Visited Thaal after a long wait on the bucket list. Went with friends to celebrate Eid, were not disappointed. A perfect place to spend an evening with family and friends. Set right across the Mandovi river near Reis Magoes fort, a beautiful idyllic setting, no fancy or jazzy decor to distract from enjoying the riverfront. The food is delicious and tasty. Started with salad of chana potatoes and Moong dal samosa perfectly fried to crispiness while waiting for friends to arrive. Then had Mutton samosa, chiken cutlet for starters, later mutton keema pao, white chicken, mutton khichdo accompanied by crisp Afghani roti, unique gulab jammoon ki sabzi with porotha and last but not least mutton biryani without it the celebration would be incomplete. For desserts had imli kulfi, Ummanali, sheer kurma. Drinks couple of beers , White wine Shangriya and coke. Recommend a must visit when in Goa.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlfV0PjTh5IwmQRKhr6OME9mHPUUnOf6nm6Zbv0XjekeWa1KN0-IvrbxDnWkU4P9f3OMQKxysjCy3m4zr8-ayD3Nvww4lRw_EDF-phy6ImOiH6n3BhipHXZ5VQ_0EdvJC2CYHA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdluwgcEXcjupNZPHnTJhbWtFcQxZvqCiXvQbRSbP8KWCp_45zeX8DALq9S6GLlL3_lWb9xZbRkShykv2Jzl5AUdMREryLYcEfG2nmcpKtQMM23ANme3OxbH9UyBPF4H-_B3T3bS=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkzf3gSx5F9Clm2bY-uqt4rAwuQqqd7D-Lp38YyGjqtDwFS7arbEkPGV5wR_AD7tCoF8z25cx8gh0BrknT8Vo3ljAF_ojt1STofYKyt88T2_YRXBW6pvmBnAGVyAkD1MaYOw6e9=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkGNE0dtpnQAfhBOowwMxvnnRwnkyHEbEVDdmkYKSjdZcBHoIb5r4d-CqTuhsl8bYOe1hvqFKHlf5DaYSPvOTpOHBHdmymhRwk2xaeJoElvD3hqCOf7ca2nmQn_UBFJ5BJ4R_E=w375-h281-p"
            ]
        },
        {
            "review_text": "Everything on the menu seems to have been selected with so much thought that you get an array of flavours to choose from. If you're looking for a place with delicious food, big portions, a cozy and scenic ambience, this is the place to go. Don't forget to book and experience their signature Thaal if you're going as a group. I keep going back for more.\n\nP. S ~ Sunday evenings they have a live music performed by amazing artists. You're bound to have a great time",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdm3kXl5RA4nyxVaVrBc4_HczO-b5cOcJFAOXJQnQEB-13_q5IP4Xn7Lri1zUffXVCwop2VNV7cF4xFU8JspYnOps7V6Vbrrt-KysoQgBxfYGuPDmgoPTPSYo5zhZvYTk4q2fOkYLA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkWkQBnp0YdjO6skormt4X2YnsThhKu2K_EgjqxspFSZfzhS9QDCV3DX-ozPBtMJLu_i9A-van5IULMspNJlWCYyz4ofIN8q9D7QgszGr1Rgs6UCfkMn4hr1mqyq3KUIsr_A6GYQg=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdm2oktdCgvYkX-vI79e9DB99FewhVO-LxQP4s9ixasnT3qWVCacsc_ASgwbjHTzJq23KbmymWuAmihpjYdL2jkVrCIaOepaYur_lEZT9HXwLtiokHgVwaS0w1dpZ2SWGnWW8R0=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmbqfqjucQq-o1bU1GEanfFxICHWXk_KU_aU83G8rkba3NG4OMUm7quL8jMqLLmPWXviv6N-Xh9-WMNsnJ8aZxrzULbscGxJYygEadLurPd5Q-kQ0kHamen8k8Rq_pLwz4I6aUy4A=w375-h281-p"
            ]
        }
    ]
}