{
    "id": "1c7c5b73bf6e0d80fb29a2f42e322156",
    "name": "Sharda Classic Panaji",
    "star": "4.2",
    "number": "2404",
    "score": "10096.8",
    "area": "Ribandar",
    "url": "https://www.google.com/maps/place/Sharda+Classic+Panaji/data=!4m7!3m6!1s0x3bbfc0893481fd71:0x9622632d12ef156e!8m2!3d15.4992742!4d73.8261043!16s%2Fg%2F11bwyf54hd!19sChIJcf2BNInAvzsRbhXvEi1jIpY?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipPImfCYiT4FK6E2iUkGZputaaf1TBUbzHc3fy9E=w408-h272-k-no",
    "tags": [
        {
            "tag": "thali",
            "count": "163"
        },
        {
            "tag": "goan",
            "count": "45"
        },
        {
            "tag": "kingfish",
            "count": "12"
        },
        {
            "tag": "non veg",
            "count": "10"
        }
    ],
    "reviews": [
        {
            "review_text": "Shradha Classic is a good place for families to dine and have a pleasant time. The ambiance and setup are nice for a casual outing. However, our experience with the food was mixed.\n\nWe had originally visited the restaurant to try their thali, as recommended by reviews, but were disappointed to learn that it’s only available in the afternoon. As a result, we had to order other items from the menu.\n\nWe ordered Chicken Tawa Fry , expecting large, substantial pieces based on the image displayed. Unfortunately, what we received was very small, thin pieces that felt overpriced around ₹380. When we inquired, we were told the image was merely for marketing purposes, which was disappointing. Assuming a larger portion similar to tandoor-style chicken, we were let down by both the size and presentation of the dish.\n\nChicken Manchow Soup: It was decent in taste, but the chicken quantity in the soup felt insufficient.\n\nChicken Biryani: Was okay, but nothing extraordinary.\n\nSeradura dessert: It was a complete letdown—it was served frozen and lacked the quality I've experienced elsewhere. I wouldn’t recommend trying it here.\n\nOne suggestion for improvement: Please Ensure dishes are served fully and neatly, with no half-filled bowls or incomplete servings or little leftover. Presentation and portion size should align with the price and expectations.\n\nWhile the place has potential, the food quality and consistency need significant improvement. This review is based on my personal experience, and I hope it helps others make an informed decision.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdl6I8ZHnNGpiLdhjHMqdZWqT_BIoYIhBUHjIObQ163uvYtMOLqRHeTRSv4y0FmljPMxEt6qutU3C1P8kn6AmpgNgFpDO6Fs1_jFpsrpzV8QyAvI6zyNFBr_KQjeyl1dQHz-xG0=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmXN9rZL1FJOEWF5g8o86UzgVGEIGexa_Z9zoz0Lr7Whie_PtqAcD3KRDfuhr_zA_XmFZwzbXBDSP52G5VUkCqUuXcMV4LyQYlk6JMH5cu3IS7mPKvbE0n2jbJoL2gGQkK9n7Wa-Q=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmKW11D303U24qNgX8eGV-vx76tQhQ5jmCj4ZNBG10jIBaDHaSk7ypV_gp_2ifFcWCMVYftbS0YOvTibSj1037tZ6R9enYtxda20C4BB_XuZxA78-qq4eHdC41YO1FarIoEd7Lb=w375-h281-p"
            ]
        },
        {
            "review_text": "Visited this restaurant for lunch on 2nd November 2024.\nAtmosphere was calm and service was good. Tried Chicken Lollipop along with Chicken Suka and Veg Fried Rice. All were tasty. Will visit again in future.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmbIjy89jSKRrAmfIOJZqzFt7-Dm2N0d3u4NSaP_6BO-mLiXApu7KRS8fHtiB-pafh79tZbh4pFlsvwh4JJcyjXAdqxd-0RFnrlA_DNih57O4m7qQV_K5Px2i1tPILCow1wlYY=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkopt9Y_LAuLgi7ikxZTVcvXSdjFf3EC9PugOLcWqgmcPLkSBwOOW6mkL0fMkaSZQk4BNnNDX1kW2KyoKjIaTNrJvKT3Q1SSlJU3oDgnFjb5TVdPFiCWRLP8E5_gazzG67PsAxLFA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnmhEIaUGhVxRNBl1JTu5XDGQimefkz2bMYbkR9omRFslNZ2woxOhVAyvez0pLZO473AYTNXYwKycjgvGuQXmaPoB2sVSsW2gSvO0YVvRLR45vgathq4nR2e8INGpUC_BgZX-O5=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlg-l2zaY5cItDU0BqOHEQShpWw5XRfCAFf-S5uZAa51fU9R5ps7EIloMpewJiUQdJYnA_3dCwcO-ADUwIKzW3KBndmhR6YqLZ0bXSSl8BINwV5cuh2Xs4EhQngKj7h8J7psXve=w375-h281-p"
            ]
        },
        {
            "review_text": "I’m a big fan of Manchow soup, and I’m always on the lookout for the best ones! At Sharada Classic, their Manchow soup truly stood out, It’s the best I’ve had. We also tried their Banjara Chicken Kebab, which was delicious with tender, fresh chicken, and the Mushroom Chilly Fry, which was equally tasty. I highly recommend checking this place out! Although we didn’t get a chance to try their seafood, which they’re known for, I suggest you don’t miss it!",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmiUmirg7F0Q6t-RAMjBX7mguXjVlhJlGUrT05SO5F0GZKptn9NKgYnOnaRs_yYeZx87qOQrJf35uMm4LNYmw03nfcjjqrYa44CRXQrF9-ZPR6aDnwNVTpxILhhqIVOd9SVn66_=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnMqsZpwrI459sasSwcoc_zUuY8IzcPZVC8GV73svrYFsu80E9Go392X6n53cLX7cNeMTh0jL4ZGFKjM8PsmdC3NmKr5wZ6ljtCKGja-UC3DQx1tdmBYEImn8v1HH6xzJ35FvAl=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmBKl62sEQHJBITEo7nzac9aWflgpAWmH67YeYHxboLrra1h2v6o_5vKYP1_tPu4TkQgk2ic84B4C_bx4iSjgJNuERnnNlRyti6LR013RSE6uOu4sTiN32v2OplpD1bPgd8RieOcQ=w375-h281-p"
            ]
        }
    ],
    "description": "**Restaurant Review: Sharda Classic Panaji, Ribandar**\n\nRated at an impressive 4.2 out of 5 by over 2400 patrons, Sharda Classic Panaji stands out as a popular dining destination in Ribandar, particularly noted for its thali offerings, Goan flavors, and a variety of non-vegetarian dishes. With tags indicating a strong emphasis on thali (163 mentions), Goan cuisine (45), and the prized kingfish (12), it's clear that this restaurant is carving out a niche for itself in the heart of the community.\n\n**Ambiance & Design**\n\nWalking into Sharda Classic, diners are greeted by a charming ambiance perfect for family outings. The space strikes a pleasant balance between casual and inviting, suggesting a well-thought-out design that encourages relaxation. Patrons have noted the calming atmosphere, complemented by soft lighting that adds to the warmth of the setting. Photos provided by customers showcase tasteful décor, featuring local artwork and cozy seating arrangements that create a welcoming environment for both casual lunches and family gatherings.\n\n**Menu & Culinary Experience**\n\nThough the famed thali has garnered considerable praise, it is only available during lunch hours, which may catch some diners off guard. This led one reviewer to explore the wider menu, including the Chicken Tawa Fry, although expectations were sadly unmet due to portion size and presentation issues. Nevertheless, other dishes, such as the Chicken Manchow Soup and Chicken Suka, received positive feedback for their taste.\n\nOne highlight from the reviews was the Manchow soup, cited as the best one sampled by a regular enthusiast. This dish, along with other appetizers like Banjara Chicken Kebab and Mushroom Chilly Fry, seemed to elevate the dining experience for many guests. The restaurant's commitment to flavor is evident, though there are calls for enhanced consistency and portion alignment with pricing. This feedback reflects a desire for improvement, especially regarding the dessert offerings like the Seradura, which did not leave a lasting impression.\n\n**Customer Experience & Service**\n\nService at Sharda Classic is generally rated as positive, with customers appreciating the attentiveness of the staff. Many patrons noted that the service was efficient and friendly, aligning well with the restaurant's family-friendly ethos. However, some reviews suggested a need for more transparency about dish availability and quality—particularly about the marketing images used on menus.\n\nThe restaurant's approach to reservations and walk-ins remains unmentioned in the reviews, implying a relaxed, open-door policy which could further enhance its accessibility.\n\n**Popularity & Reviews**\n\nSharda Classic enjoys a lively buzz on social media and among reviewers who highly recommend the establishment. With a strong recommendation for seafood, particularly from those who didn't get to try it, there's an air of anticipation around what else the menu has to offer. The accumulating positive reviews indicate a growing local favorite, bolstered by the restaurant's potential to refine its offerings.\n\n**Utilizing Visual Content**\n\nPhotographs shared by guests vividly capture the inviting atmosphere and highlight the food presentation, offering a glimpse into what diners can expect. The lush, homey vibe paired with dishes like the Manchow soup and kebabs exudes a mouthwatering appeal that enhances the restaurant's profile. \n\nIn conclusion, while Sharda Classic Panaji holds a solid reputation within Ribandar with its inviting atmosphere and tantalizing menu, it faces challenges in food consistency and presentation that, if addressed, could significantly elevate the dining experience. It's a treasure for those seeking a cozy spot with a diverse offering, where the Goan flair and heartwarming thalis await discerning diners."
}