{
    "id": "20250206005553_398",
    "name": "Annapurna Hills",
    "star": "4.5",
    "number": "115",
    "score": "517.5",
    "area": "Anjuna",
    "url": "https://www.google.com/maps/place/Annapurna+Hills/data=!4m7!3m6!1s0x3bbfe9b61325759d:0xdf3ea5792f501bfb!8m2!3d15.5920272!4d73.7441022!16s%2Fg%2F11nys0v8wr!19sChIJnXUlE7bpvzsR-xtQL3mlPt8?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipMPNLtY6shg4mISmLCUs_HHDvvvOLdrRz7mUOg_=w408-h544-k-no",
    "tags": [
        {
            "tag": "price",
            "count": "8"
        },
        {
            "tag": "tandoori chicken",
            "count": "5"
        },
        {
            "tag": "drinks",
            "count": "3"
        },
        {
            "tag": "fried rice",
            "count": "2"
        },
        {
            "tag": "fast food",
            "count": "2"
        },
        {
            "tag": "butter",
            "count": "2"
        }
    ],
    "reviews": [
        {
            "review_text": "Highly Recommended:\n\nIt may look like an average shop, but you’ll wonder why it’s always crowded.\n\nThe food here is good, with generous portions. The service is excellent. The person who manages the store is one of the coolest people I met on this trip.\n\nHe accommodated our food preferences, such as Tamil Nadu-style dishes, fennel seeds, less masala with more spice, and some dishes without spice. He continued to do this for all my subsequent visits before I even had to request it, and he manages to do so even during his busy schedule.\n\nHe offers disposable plates and cutlery without being asked, speaks like a friend, and provides quick service. Another major benefit is that it is open until 3 a.m. most days.",
            "photos": []
        },
        {
            "review_text": "Exceptional culinary venture! This Indian restaurant's mastery over flavors left a lasting impression. The artful blend of spices in each dish was a true celebration for the senses. The staff's dedication to creating an inviting atmosphere added to the overall charm. Be sure to indulge in their specialties; you'll leave with a newfound appreciation for Indian cuisine's depth and complexity.",
            "photos": []
        },
        {
            "review_text": "This is my favourite restaurant\nFood is really amazing",
            "photos": []
        }
    ]
}