{
    "id": "20250206010906_425",
    "name": "Samhen bar & restaurant goan cuisine",
    "star": "4.1",
    "number": "104",
    "score": "426.4",
    "area": "Majorda",
    "url": "https://www.google.com/maps/place/Samhen+bar+%26+restaurant+goan+cuisine/@15.3127707,73.9082987,17z/data=!3m1!4b1!4m6!3m5!1s0x3bbfb6e96f557aa5:0xdab8c00dbe336b11!8m2!3d15.3127707!4d73.9082987!16s%2Fg%2F11cs4jl0rz?authuser=0&hl=en&entry=ttu&g_ep=EgoyMDI1MDIwMy4wIKXMDSoASAFQAw%3D%3D",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipMCSmDJ1ADGy_tQQqrlxHv8Ac4YJNREOZHM0bvk=w426-h240-k-no",
    "tags": [
        {
            "tag": "prices",
            "count": "15"
        },
        {
            "tag": "beach",
            "count": "5"
        },
        {
            "tag": "prawns",
            "count": "5"
        },
        {
            "tag": "television",
            "count": "3"
        }
    ],
    "reviews": [
        {
            "review_text": "Been here on Dec 27th 2024 with wife for dinner at 8 pm, ordered in 5 mins a drink, starter, and a salad to begin with..got the drink in 5 mins and that was it...after speaking a lot of times pleading and ultimately threatening to leave, got the green veg salad after 1 hour 15 mins (that's a new world record by all means), the starter followed half an hour later which was one hour and 45  mins from time of order which was another record by itself..Finally after me and the adjoining table understood that if we ordered dinner, it would reach us by midnight or probably later and decided to order together two plates of egg rice with the condition of 15 mins or quit, which was given but food wasn't great. The prawn chilly goan style was a disaster with mini sized prawns buried under a ton of half baked onions with resemblance of onion bhaji..reason given was no staff as they had to attend a catering event...if no staff, please close the restaurant but don't disappoint customers like this..at any given point of time there was no more than 5 tables occupied and many left midway waiting eternally for food..and oh..overpriced food and over billing. Ordered 1 large drink, for which I was charged for two small where rates does differ significantly. Quite a disappointed evening and experience..😔😔😔",
            "photos": []
        },
        {
            "review_text": "We ate here last night and i can say nothing more than terrible food and terrible service.\nWe have been in Goa travelling around for 5 weeks and had just arrived in Majorda yesterday.\nWe took a good walk around along the beach and around 8pm we entered this restaurant.\nFrom the outside looking in and the location of this place it should be amazing.....prime beach road spot and looks lovely...but that's it.\n\nWe sat down and about 15 mins later menus were thrown on the table...no hello...no welcome..no smile.\n\nWe sat, we sat and we sat. Finally we ordered drinks and then yet again waited and waited.\nFinally our order was taken...this should have been the warning but we stayed.\n\nIm not sure how long we waited...1 hour ...1 and half hours....the food finally arrived\nAloo gobi...cauliflower limp as a lettuce and cold\nDal tarka nothing more than like dishwater...no lentils in here just like water.\nAnd as for the naan bread...we asked for cheese garlic......they checked again what we ordered and then out came the naan...cold and grated cheese sprinkled on top.not melted..disgusting.\n\nWhen we asked for the bill it came in 1 minute ...they couldnt wait for us to leave.\n\nThe place had 3 other tables in\nThere is absolutely no need for this awful food or service\n\nWe would have been visiting here regularly im sure but NO.\nNot a good start to being in Majorda at all.\nThe staff need changing ,front and back of house and the owner needs to sort this out.\n\nMy advice don't go here.",
            "photos": []
        },
        {
            "review_text": "Samhen Restaurant is a family run Indian cuisine eatery and Selfia, the owner, is very welcoming and friendly, as are all the staff.\nWe have eaten here many times, as part of a group and as a couple, and enjoy the atmosphere.\nThe food is well prepared, full of Indian flavours and spices🔥if you like it hot or mild just ask.\nIt is very affordable and when you consider how many locals use Samhen Restaurant it speaks for itself.",
            "photos": []
        }
    ]
}