{
    "id": "20250206003415_263",
    "name": "Hotel Shagun",
    "star": "4.1",
    "number": "871",
    "score": "3571.1",
    "area": "Aquem",
    "url": "https://www.google.com/maps/place/Hotel+Shagun/data=!4m7!3m6!1s0x3bbfb3c1145486f1:0x46561c4ac219d5a4!8m2!3d15.2704216!4d73.9608038!16s%2Fg%2F1thw559b!19sChIJ8YZUFMGzvzsRpNUZwkocVkY?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipPJeP7955kREgl_muxX3gtvJJoVi3M0z5chfGf8=w426-h240-k-no",
    "tags": [
        {
            "tag": "price",
            "count": "23"
        },
        {
            "tag": "mutton biryani",
            "count": "17"
        },
        {
            "tag": "halal",
            "count": "8"
        },
        {
            "tag": "non veg",
            "count": "7"
        }
    ],
    "reviews": [
        {
            "review_text": "Having eaten here before when the restaurant first opened and having been a regular visitor one-two times every year, it is sad to see how far the restaurant has declined.\n\nAs I entered the restaurant, the smell of decaying meat welcomed me. Staff were not bothered to give you a menu or take the order. Most of the time they were just lounging around.\n\nThe food was average. Chicken Schezuan was not cooked, just chunks dipped in gravy and served. It smelled bad too. While eating, a cockroach fell from the ceiling into the chicken dish and saved me the trouble of finishing the dish. I called out to the waiters to take the cockroach away and they're just watching the cockroach struggling to get out of the gravy. The cleaner boy was atleast responsive and took the dish away. I did not even bother to ask for a replacement dish.\n\nThere is a lot of improvement needed in many areas of this restaurant. If the waiters and staff seem least bothered about their own restaurant, then you should also not bother.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnadz2bUyw8PlEuokJL8Yo-iTmdmxiAqZOXcVxN8mKx7QVvC95ZJHBWyloFUJQY4VQLfD0RmRxEvhYpv2xbOVoMK6iKHKOGAykiiXZLqDaBOXMhctzBVP9hT4ApPOqXMavZC2FciQ=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlO5AfRApSMVuC_9hSDMTpAxfkUoVoWKA0phoI9cBznOPfBIQ3NBcS7K2knOFfXCj7rzFRmPEKxKC12J4rDeYkV5enZL9QvqoicUQ8SDMfXsFeUVbJqBg-n57EIYX8qAPpBmfRb=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmc6gkxIYsMzXbO_2-COfN5S6RaHvCSaMX0hkR5WXLJwTnVYnaGwI3M0lflj_LG5_J6WjYxpqscANuuadAR-Li0uL09O5qOtkHBowFNvJSlJelno6-2XZjRzh8cb7pHkP50zsEMcg=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmOvBpqxEMJ2ZwVToCt0DAzMBGicfLFRP8XqJoxFa243S2T___yxiEdjYrahiNBImgaeNLi5rllE70zxwT331zO-bNC2DKMIyk7vqn-gdNdNtKs7scPAYzq4ZmExMM-cO7-SRY=w375-h281-p"
            ]
        },
        {
            "review_text": "One of the best places to have your favourite biryani in Goa. I just love their mutton biryani and malai tandoori which is the best I have ever had that no other places ever offered such a fantastic delicious food. I had my pre-wedding food catered from them. Definitely offers quality food and assures quality. Thank you so much for delivering superb food.",
            "photos": []
        },
        {
            "review_text": "I recently had the pleasure of enjoying the chicken biryani at Hotel Shagun, and it was absolutely delightful! The biryani was perfectly balanced – not too spicy but with just the right amount of masala to give it a rich and flavorful taste. The spices were well blended, enhancing the overall experience without overwhelming the palate. The quality of the chicken was excellent, tender, and cooked to perfection. If you’re looking for a biryani that’s flavorful yet gentle, I highly recommend Hotel Shagun. A must-try for biryani lovers!",
            "photos": []
        }
    ]
}