{
    "id": "20250205235248_234",
    "name": "Waterfront Terrace & Bar",
    "star": "4.4",
    "number": "374",
    "score": "1645.6",
    "area": "Complex Altinho",
    "url": "https://www.google.com/maps/place/Waterfront+Terrace+%26+Bar/data=!4m7!3m6!1s0x3bbfc0ef2c4d777d:0xf8cfc829f10096f2!8m2!3d15.488223!4d73.80992!16s%2Fg%2F11c6_xk8x5!19sChIJfXdNLO_AvzsR8pYA8SnIz_g?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipOn239Krf1j2_f29BEJTJmTXkz2ty4YR5qGdpbh=w408-h272-k-no",
    "tags": [
        {
            "tag": "buffet",
            "count": "22"
        },
        {
            "tag": "service",
            "count": "21"
        },
        {
            "tag": "experience",
            "count": "17"
        },
        {
            "tag": "dinner",
            "count": "12"
        }
    ],
    "reviews": [
        {
            "review_text": "Visited a few days ago, the staff was kind and helpful, the view of the sea was pretty.\nThe buffet was lovely, lots of variety in cuisine and dishes as well. I specifically loved the seafood dishes from the starters and main course. The desserts were great too",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdl-Ype7uTS5BYkElKEptruOW9sZuM7QlAdAEw0a-Xu8yLzpofS0gDgPVocpf2soGV2sdY8NThk-n3ns1ffH7Ekn5ZbZAxHJ0ROKZWdJeMEOPlkA6abUnZ_Io1WOgFBcsSYyf99J=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdl7PxpKd31yraPvPKxjgv7p_YBht8nbk5J-qWVzYudA2i5YRh6siUcoERL61_e8GaogrpdAjLmKHQ6zXkvoCIf3gNWon5zxfu_UMlGyhSqMoAXKUe7bHivtHcBOi5qze-Jkn3IDhA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmA6DiCmPNqEIkAOoOd-BOPhQrWS9GYiuI8MGHeKY6xUveKIGD13BsF5ae9P_ziC71FRx3ZW1l74da8nt2mQ56TeSPPu-5niDSvbI3WziexBTZaNnhHnqben1AtAXuGWsuofhN0=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdk5n3MfgVLRmd511fIV2zalXt_ZJvsDQXM4-OIhUdSHHO4_ndpwLnzVrG4dhODxfGUC9S8J_gdBNeTpLr7SoRhMFZ5BkyyN2hHBmFwwuSeQMdVJ_0HV5RiJy2bk_b-bscVJre4gEA=w375-h281-p"
            ]
        },
        {
            "review_text": "They bake deliciously colorful breads.  The basic Indian food is also great (but the Dosa did just that).\n\nIt is very busy, but I express my gratitude to the staff who fulfill the order quickly and accurately.\n\nEven if it is a bit far from food, I recommend the terrace space where you can dine while smelling the sea.  Of course, the barbed wire fence puts down the atmosphere a bit, but anything is good under the blue sky.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlrGRy1ZYE5JKm6WIwA3PQLsE0Eo74DRNfeM3BYn9-dMw5bfO-_YjhM5SExMSG9nb3JumVX4gbmo50ANGr1kp1EoT6ocR15CxcOJZ49VyEoWe9JeEWmC8yRmlEnPhuCi65h20gT=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmAGyb9T-cZKY9z27YJukB7o97bkL5xE1op0eubHmf78NytY-EELqxdMVWAPTyFL895vqPiEhrIcriPsyK9KwudN2MvgawU9KNUMaF9CTQhl3pe00sbA1SFIIubCgfN-Mjp2vQkyg=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkLahQE2HzYnGfv5vtJQb2fRHRRR0LkhOdDoX9Yiky-J582h1ONBL6mAi8KFBbSDmmQ329VxFsia5iwxf6HEoD1kJVfo-Hibk22Cg00qDiTTW7PMFpiC6gHxAjgyDir-xdCdcs=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmw844uy0gnQU8V3H5kmADdUqm-s1boBIJYHy9izfeRfHMu4mBOdfURkrygauv8OdRau8S44x1w3Vw7CrCErwmZ9gHisq1YRH0PaNJXVyy1PdHF19qUvv53hM6HML7naDZkO9AIHQ=w375-h281-p"
            ]
        },
        {
            "review_text": "Awful experience with the buffet. Food was cold, and service was extremely poor. Let me break it down with respect to the service and food respectively. Service was almost non existent. We sat down at the table, and the napkins and quarter plates weren't laid out. We had to ask for them separately. Later on plates weren't being cleared and as you can imagine, the table gets quite chaotic especially when you have 9 people with you. Counters were unmanned and upon inquiring with the staff they give a curt and rude response saying they will attend to it when they come. Mind you this was mid service at 8:30 pm when your service is supposed to be at full capacity. Dishes were not being replenished and all items on display were cold and not properly maintained. In fact some items that got refilled right in front of me were also cold. How is that even possible? How can cold food come from the kitchen?? Water wasn't provided at the table and we had to ask for refills specifically since staff refused to tend to the table of their own accord. It honestly felt as if they were doing us a favour as opposed to their job and couldn't be bothered less. One might almost assume they were paying us for dinner and not the other way around.\n\nNow coming to the food. The spread was mediocre and lackluster both in terms of range and taste. Therr were no mutton dishrs and all the fish dishes were fried in cornstarch and covered up in sauces so far from being fresh and the flavour of the protein was lost altogether. There were no mutton dishes on offer. There was only one nonveg main course offered and none of the live counters outside were active. I visited last time in November, with three others and had a decent experience, and was especially happy with the kebab counter, live pizzas and desserts, so this time I brought along 9 others and was looking forward to a good night. To my astonishment, I found the kebab counter and pizza counters were not operational altogether, and the spread range had been cut down by half. Even the desserts menu has been slashed by 30 percent... And the buffet price (2400Rs) did not reduce mind you!!\n\nFor a five star restaurant, this was absolutely shocking performance. if you're reading this and wondering whether to dine here, I would suggest that unless you're eating free of charge as a room guest and have no other option (literally any other option would be better, at least the staff will provide decent service) STEER CLEAR!!!!\n\nMassively disappointed and honestly ruined a good night I was looking forward to both for myself and the 9 other people accompanying me.",
            "photos": []
        }
    ]
}