{
    "id": "20250206004014_356",
    "name": "Branco's Restaurant and Bar",
    "star": "4.3",
    "number": "155",
    "score": "666.5",
    "area": "Complex Altinho",
    "url": "https://www.google.com/maps/place/Branco's+Restaurant+and+Bar/@15.484164,73.8203868,17z/data=!3m1!4b1!4m6!3m5!1s0x3bbfc09541467ba7:0xe261113e7021d2c2!8m2!3d15.484164!4d73.8203868!16s%2Fg%2F1tkc0kgy?authuser=0&hl=en&entry=ttu&g_ep=EgoyMDI1MDIwMy4wIKXMDSoASAFQAw%3D%3D",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipOXQXsqb8DiBnwHUQQAmyukhbihafznfm3ewqb1=w408-h510-k-no",
    "tags": [
        {
            "tag": "chilly",
            "count": "8"
        },
        {
            "tag": "pork",
            "count": "6"
        },
        {
            "tag": "cafreal",
            "count": "5"
        },
        {
            "tag": "prawn curry",
            "count": "4"
        }
    ],
    "reviews": [
        {
            "review_text": "Good ambience.\nBut with just one person taking care of the food, ordering, serving etc... etc.....\nThis is human torture.\nThe food took forever to come, the kids were hungry and tired waiting.\nThe owners in their own room only catering to their friends not seeing how this poor man was handling the whole restaurant by himself.  Kudos to him. He deserves a big award.\nThe pork ordered was not cooked enough either.\nWake up you owners and show concern and appreciate your staff who serve us well.\nI will not advice anyone to come until I know there's better service with more staff and food served faster.\nSorry.  But I don't have a good opinion.\nPauline Olivia",
            "photos": []
        },
        {
            "review_text": "Words don't even begin to describe the food over here............ Wow, amazing even mind blowing doesn't come close to describing the food. Started with a simple French fries which were really good perfectly fried and amazing. Then had some pork chilly fry (if you love spice don't leave the place without trying it.  If you so then maybe you should k? @$ yourself). And then finally had some beef chilly fry which was so soft that the meat melted in your mouth.\n\nPlease go and visit the place you won't be dissapointed.\n\nService a bit slow but was worth the wait",
            "photos": []
        },
        {
            "review_text": "The aroma of the  food literally calls to you . It's easy to become a regular guest here , once you dine, you'll definitely be back for more !\nService is prompt and seamless",
            "photos": []
        }
    ]
}