{
    "id": "e95821081e0ac1cbf146a6f86d6b1499",
    "name": "Low & Slow",
    "star": "4.6",
    "number": "654",
    "score": "3008.4",
    "area": "Goa Velha",
    "url": "https://www.google.com/maps/place/Low+%26+Slow/data=!4m7!3m6!1s0x3bbfb90ff6b35d01:0x90fb79e26b2cd866!8m2!3d15.4421519!4d73.8819296!16s%2Fg%2F11kkcv_c4t!19sChIJAV2z9g-5vzsRZtgsa-J5-5A?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipM0UAH72SfPe10_YvgHVxWN2euPrQMcs-xAhRTy=w408-h306-k-no",
    "tags": [
        {
            "tag": "brisket",
            "count": "66"
        },
        {
            "tag": "pulled pork",
            "count": "27"
        },
        {
            "tag": "pork ribs",
            "count": "21"
        },
        {
            "tag": "platter",
            "count": "21"
        }
    ],
    "reviews": [
        {
            "review_text": "If you're a fan of perfectly smoked and slow-cooked meats, this is the place to be! The brisket was tender and flavorful, and the barbecue ribs were fall-off-the-bone perfection. The cozy ambiance and attention to detail in every dish make this a must-visit spot for meat lovers. Highly recommended for anyone craving authentic BBQ!",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlXzNd2whH3c8GdlWBAZW0g1KLgi-eoF4JfE__gnPhBQBwLppPDLb_0UDmjMXuMZtc6tBOBCGRt_YG5yJLU1HOLDzngYaUU1J2Itpkk5y-MeggoFA2Tge8UEbQtRVitslJXemc=w750-h563-p"
            ]
        },
        {
            "review_text": "I recently visited Low & Slow, and it was an incredible experience from start to finish! The moment we walked in, we were greeted with a friendly atmosphere and the smell of smoky goodness.\n\nThe ribs were fall-off-the-bone tender, perfectly seasoned, and bursting with flavor. The brisket was juicy with just the right amount of smokiness, and their house-made BBQ sauce was the perfect complement. The sides were just as impressive—mac and cheese, and coleslaw all hit the spot.\n\nService was a bit slow due to one one server available and the portions were generous. Whether you're a BBQ lover or just looking for a great meal, this spot is a must-visit. I’ll definitely be back for more!",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnj2bpJtVkovE-ig_tx7bfGCjZdKj4Qtp0xmKqphjMkqXD25AHw9_4QYxUKpwJ7NS_loHVVkzjRE9cWzRQXG5yxyC6KI9kM1hbmqqmCm01ucrckpTGoxTzf5eLBkd1neVN8b4ks9w=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdk_sJDy0LhOq5HdaIHqML14XLD08WzjGyT9FhABJKw5ScOpam-T3wrTfcfaXAY8UX05FdHmEGu2xvbC3jGUC709vxN8v1Mdd3UEzPC8bliaSgIb0ZKjxMrAQ32cnHKHyGmVOos=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdna_xeeFN0L3L6JepR5ztxWw2bhe2pf52syfN7rK07uX2rwB_EkSbHL45UK7Ct5hxIrGfM9voR4zMczpEFfwLJP2FqZxQJX4yDFebXco63jUe5OVjb-_UUXMkiqDf4y9kMasD3nWw=w375-h281-p"
            ]
        },
        {
            "review_text": "A Bittersweet Experience.\n\nWe decided to visit Low and Slow after seeing countless stories and \"influencer reviews\", but sadly, it turned out to be more hype than substance.\n\nStarting with the Chicken Caesar Salad, it just wasn’t up to par. We’d give it a 2/10. As for the Baby Back Ribs, they left much to be desired. The so-called \"original BBQ sauce\" wasn’t delivering. There’s a saying I like: “If it ain’t broke, don’t fix it.” That is, sometimes, a simple, store bought BBQ sauce does the job better. I initially thought of giving the ribs a 6/10 for their tenderness (though they were a bit too tender, in my opinion), but the score dropped to a 4/10 due to an oversight—when we requested the dish to be packed as a takeaway, the fries and coleslaw (which were not eaten) were missing. What happened between the table and the packaging is a mystery?\n\nThe Isabella Burger was probably the standout dish, earning a solid 7/10. It was cooked well and tasted good, but it could still use some improvement. For one, the burger is so stacked that it’s almost impossible for an average person to take a bite without making a mess. Also, the fries served on the side were disappointing—too small! I’d recommend switching to larger, more satisfying fries (in general).\n\nOverall, our experience was a 6/10.\n\nA final suggestion: consider hiring more staff to manage tables, especially during peak hours. Service can get overwhelmed as the crowd grows. And perhaps space out the tables because it can get claustrophobic as they’re too closely arranged.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlUKHxFWdMjSLcDXl2JuTlhDwv6yCSCE3BQZPzBXG7LPsJGiZVGFQPrnUIcZzC_H6ir3qskqmXNNfZgAAByV2Fb1DjOev3dhOUUjFiSI0-IzziLYxkA8GAcf2qIxuHNetPdMQ-i=w375-h563-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdn_RIiGvasgFSOaOLTmvDVLnoO8PFEifDMLIgGNbRJmaYL-i_SQYM0zTAG_SgECrKbnnHAaozF6gFzF5n7yd-7P-EEIKyglhKWdn-dfh5NyBgMs4KDCMLV5IjpZeCAlkD8N7MQ=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnc_NhgbXPx-NcRzJbSjqExVJb362VvoDINBWiJDSQWQjnBSH7pyJDm5Nk-zmqqZfbkkIZhhiAVsk9Q00dRVBXN42_iKXX61OCJOjggQ7k-vJzIznvVFGOAk7paPv3EJm434cfj=w375-h281-p"
            ]
        }
    ]
}