{
    "id": "20250205235854_253",
    "name": "Claudina's Shack",
    "star": "4.1",
    "number": "332",
    "score": "1361.2",
    "area": "Candolim",
    "url": "https://www.google.com/maps/place/Claudina%27s+Shack/data=!4m7!3m6!1s0x3bbfc193ced79ba5:0x990228376657530f!8m2!3d15.5179658!4d73.7630813!16s%2Fg%2F11b6hv8l9_!19sChIJpZvXzpPBvzsRD1NXZjcoApk?authuser=0&hl=en&rclk=1",
    "restaurant_image": "https://lh5.googleusercontent.com/p/AF1QipNrMYgZe3g0vSKFHS18StXV-jCk0vTSFWHBp4Ix=w408-h272-k-no",
    "tags": [
        {
            "tag": "beach",
            "count": "26"
        },
        {
            "tag": "music",
            "count": "18"
        },
        {
            "tag": "prices",
            "count": "9"
        },
        {
            "tag": "evening",
            "count": "6"
        }
    ],
    "reviews": [
        {
            "review_text": "This is a great shack by the shore. The food was very tasty and the service was good too. We had Lobsters, Prawn chilli fry, Fish curry, Chapathis, chicken gravy and the taste didn't disappoint us. A good place to have lunch.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkZG0F-hdtCnzPsVpy9ZZAgbZpkNGucLZSANbOokTEkSRMNg_ZddqhCUVs6Lzlkaea4-s8e0SRlqmedsuCmNEyZYjkBHwqqRF8MTC31LZyyJaOOOVfLKZdEQTSkYcqbbZMKvr1G=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmLP3474_63oN__YrOlygGc8NbqK163zoPwFMNTJAqSravLPtWhNEpEGSFC8mHkrCXEscWuh_EeNumC9c1EGh4Rq6wRWZ2fTEPy_V6xka7wP_D4vNe2DxHLUYD33TrYYjvsoeUo=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlAVEhEwQVZkrxWmT3cDipxlUe8oh10sgu9zWpCOPFqVuznOA68a1WozdhThV6G_w_7mPpJzwxIXuS2tg18-6jgKs-KbSVbfeY-3eWeaRTuChxLUNySYPEsCQOEtN7TkjRGgfqy=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnDGaEytjH5GwzRe2laLGGKzDK5ZK7h5pP-h1zH7GmjEcILRXShaafb8hmTFPc6XjRrRBRxb3YE2cJq8fQ4bPDamIG5sNYWkPt2vHMFKLrP8SZpQWxVYh0F3aItDa3F-pPrlG2o=w375-h281-p"
            ]
        },
        {
            "review_text": "Claudina's Shack, located on Candolim Beach, offers an amazing atmosphere right by the shore. However, they enforce a policy of ordering to sit, if u  merely want to use their chairs and shacks they charge Rs. 300. Ordering even a beer bottle ensures a pleasant experience, making it a worthwhile beachside spot.",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdm0NpR33ryED-Sb3OVRHbQviKvtPVOa9OLa6fjAhoiK4L4ZS12QMctpZBRBQHICzri1cYtXN_2PNT3FGvrsf0UK-3MaW8_wgFaGEvLsnKVgkTtHJuUf-iC5Rt6g1QIlHyesrKE=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdmeEcxSvix52id3qV8aLklSaRZUwvt5jfHSGsX0wD3Ged7hIdDAvkXtBB0uYH-FN5kdNF72YeerrDl-okOVJnb_j-MdNjtldXgUDxlSK-fFQuX2l-ULasX4LGu_wTvqn4bte2Gr=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdm6sSQs2jJh2PHmn5qQ7vniRr2m8BFrYbSYr8uaGS3EteSQTocdyBsWnvzqrvXcS1RWBY8gBgSyWUmbPpQQnHOkC0hLkR1QPrDv3fnUDtc7pRg-ZMkuWxhpQO8qQ4hFp-_N4NWycg=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdngRvu6w-k6ffQp7UTGn67189oItMfru1HdzzC5Fcuy_psETcAZQtTH6g4b6c3dRCQD-Tmmn-XXA_3UoxjAYxc5WWnK7qLacjKEHvc8O5zItFwMZ-BoI3u_xb1rfSX5fimWW5OH=w375-h281-p"
            ]
        },
        {
            "review_text": "I recently had the absolute pleasure of visiting Claudinas Shack in Candolim, Goa, and it turned out to be an extraordinary experience that left me utterly impressed. This charming beachside establishment is a true gem, offering an idyllic setting to hang out with friends and family while indulging in delightful culinary delights.\n\nFrom the moment I stepped into Claudinas Shack, I was greeted by the inviting atmosphere that perfectly captures the essence of Goa's coastal charm. The restaurant exudes a laid-back ambiance with its rustic decor, providing a relaxing escape from the bustling city life. With the soothing sounds of the waves crashing and the sea breeze gently caressing your skin, this place offers the perfect backdrop for a memorable gathering with loved ones.\n\nNow, let's talk about the food – an absolute culinary delight! The menu boasts an array of delectable dishes that showcase the best of Goan and coastal cuisine. Each dish I tried was nothing short of perfection. The food was not only incredibly fresh but also bursting with authentic flavors that tantalized my taste buds. Whether it was the succulent seafood delicacies or the mouthwatering vegetarian options, every dish was thoughtfully prepared and left a lasting impression.\n\nOne aspect that truly impressed me was the reasonable pricing of the dishes. Despite offering high-quality, flavorful fare, Claudinas Shack maintains an approachable pricing strategy that caters to a diverse range of diners. This inclusivity makes it an ideal destination for anyone seeking a memorable dining experience without breaking the bank.\n\nThe staff at Claudinas Shack deserves accolades for their exemplary service and warm hospitality. From the moment I arrived, they treated me with utmost courtesy and genuine care. The servers were not only attentive but also eager to provide recommendations from the menu, ensuring that every guest's preferences are catered to. Their welcoming demeanor added an extra layer of joy to the overall experience, making me feel like a valued guest throughout my visit.\n\nWhether you're a local resident or a tourist visiting Goa, Claudinas Shack is a must-visit destination for a soul-soothing and palate-pleasing experience. The combination of a picturesque beachside location, fantastic food, reasonable prices, and an accommodating staff makes this place truly stand out from the rest.\n\nIn conclusion, I wholeheartedly give Claudinas Shack a well-deserved 5-star rating. The memories created here will linger in my heart, and I am already looking forward to my next visit. If you're seeking a slice of paradise with your loved ones, where you can unwind, savor incredible food, and bask in the warm hospitality of Goa, look no further than Claudinas Shack in Candolim. You won't be disappointed!",
            "photos": [
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdkuq6hlLB44QaReolg9MwqHRm6bL6m_hccIHSQv7XNbfucglqCzfYgWM3wDCVlAXv4YrAm41NitT4Op4gmXQ8mEO4R-x2FbgYi_kBHewVZKrsXYJW-_IqjtF_qwIHNBcZV65VIo=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnyz_We4blLr44ae2GrANq2gcCt7Bsjf6jJtNDcN5PHrQZ-DV9pYrGXO5aACfNunH1EXQAi7lCWWF-jKdKQLq9w73cLpYK_McCy08xFMEYhShlcUWuOi2VpKstdB1fyAqZ1tlpd=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdnLgnHnso_azNLmguaLCtCyHLTtVPsuaa3_0mDhyH81Ni-9fOK5OfQO-jNq6uYuVbvr256uvkPN8H9oWVDXuTkkDLCByr3dsExMSJ1DlXP1QovvU_Gy8euKF4YQ9arggKPKoamCnA=w375-h281-p",
                "https://lh3.googleusercontent.com/geougc-cs/AHRlGdlgI2WPt7qmcCaDeYF6XYdk8YlPWAEa0d2aJNoFTb6rsF1gQnUO4JbRF3Xm-ggdwAmX28apkx7HFIiwb1v2FhmaSP-KpZlEitXRJbVR8eKMDTycXfmRiPeguT8eHbArEaK0YayQ=w375-h281-p"
            ]
        }
    ]
}